// Хоменко Дмитрий ИВТ-25

// Подключение библиотек
#include <stdio.h>
#include <stdint.h>

int main(){
    short a;     // 16-разрядная переменная 
    printf("a = "); 
    // Записываем туда данные из консоли
    scanf("%d",&a);

    int b = 0;     // 32-разрядная переменная 

    __asm {
        mov ECX, 0    // Обнуляем регистр ECX

        mov CX, a  // Передаем в регистр ECX данные 16-разрядной переменой 

        mov b, ECX  // Передаем данные в 32-разрядную переменную из регистра ECX 
    }

    printf("b = %d",b);    // Выводим на эран данные их 32-разрядной переменной
}