// Хоменко Дмитрий ИВТ-25

// Подключение библиотек
#include <stdio.h>
#include <stdint.h>

int main(){
    uint16_t a;     // 16-разрядная переменная 
    printf("a = "); 
    // Записываем туда данные из консоли
    scanf("%hi",&a);

    uint32_t b;     // 32-разрядная переменная 

    __asm {
        mov ECX, a  // Передаем в регистр ECX данные 16-разрядной переменой 

        mov b, ECX  // Передаем данные в 32-разрядную переменную из регистра ECX 
    }

    printf("b = %hi",b);    // Выводим на эран данные их 32-разрядной переменной
}