// Хоменко Дмитрий ИВТ 25-1 

// Подключение библиотек
#include <stdio.h>
#include <stdint.h>

int main(){
    char a1;    // переменная для ввода и передачи данных в AH
    short b1;   // переменная для ввода и передачи данных в BX
    int c1;     // переменная для ввода и передачи данных в EDX
 
    printf("введите a1 = ");
    scanf("%d", &a1);   // перредаём данные из конслоли в переменную
    printf("введите b1 = ");
    scanf("%hd", &b1);
    printf("введите c1 = ");
    scanf("%d", &c1);
    
    // переменные ддля вывода (берут данные из заполенных регистров)
    char a2;    
    short b2;
    int c2;
    __asm {
        mov AH, a1    // Передача данных из переменной a1 в регистр AH
        mov BX, b1    // Передача данных из переменной b1 в регистр BX
        mov EDX, c1   // Передача данных из переменной c1 в регистр EDX
    
        mov a2, AH    // Передача данных из регистра AH в переменную a2 
        mov b2, BX    // Передача данных из регистра BX в переменную b2
        mov c2, EDX   // Передача данных из регистра EDX в переменную c2
    }
    // Вывод данных на экран 
    printf("a2 = %d\n", a2);
    printf("b2 = %d\n", b2);
    printf("c2 = %d\n ", c2);
}