// Хоменко Дмитрий ИВТ 25-1
#include <stdio.h>  // Подключение библиотеки

int main(){
    // Тип char занимает 8 бит или 1 байт, как и регистор AL
    char latter;    // Высокоуравневая переменная

    __asm {         // Вставка кода на языке асемблер
        mov AL, 0xAB    // Передаем в регистр AL значение 0xAB 
        mov latter, AL  // Передаем в высокоуравневую переменную значение из регистра AL
    }
    printf("AL = %0X\n", (unsigned char )latter); // Вывод значения в 16-ричной системе счисления

    printf("AL = %d\n", latter);     // Вывод значения в высокоуравневой переменной
    // d - Вывод значения в 10-ричной системе счисления
    return 0;
}