package dimah_d_ivt_25;
// Задание №11 Даны x, y, z. Вычислить a, b, если (в)

// подключение, со всеми функциями и классами)
import java.util.Scanner;   // Подключение модуля для считывания данных из терминала

public class  Main {     // Главный класс. Называние может меняться по желанию (имя класса должно совпадать с именем java файла)

    static void main(String[] args) {    // Главная функция. Название всегда main и всегда статичесая

        calculations_functions.assert_tests(); // Проверки перед запуском программы

        // Переменную sc типа Scanner для считывания данных из консоли (введенные пользователем в консоль)
        Scanner scan = new Scanner(System.in);
        // Переменные a, b - переменные для хранения результата (см. условие задачи)
        double a = 0.0, b = 0.0;
        // Переменные x, y, z - переменные для подсчета a и b (см. условие задачи)
        double x = 0.0, y = 0.0, z = 0.0;

        // Если пользователь передал один аргумент "help" или "--help"
        // equals - позволяет равна ли
        if (args.length == 1 && (
                args[0].equals("help") || args[0].equals("--help"))) {
            System.out.println("Программа вычесляет а и b по трем аргументам");     // То выводим сообщение в консоль
            System.out.println("Передайте пожалуйста 3 аргумента");
        }
        // Если аргументы не переданы, то объясняем пользователю, что от него требуется
        else if (args.length == 0) {
            // Вывод строки в консоль с сообщением для пользователя
            System.out.println("Введите аргументы:");
            try {
                System.out.print("x = ");
                x = scan.nextDouble();    // Присвоение данных из консоли в переменную x
                System.out.print("y = ");
                y = scan.nextDouble();    // Присвоение данных из консоли в переменную Y
                System.out.print("z = ");
                z = scan.nextDouble();    // Присвоение данных из консоли в переменную z
            } catch (java.util.InputMismatchException e) {
                System.out.println("Ошибка: Должно быть число");
                System.exit(1); // Команда для полного завершения программы
            }
            // Вычисление a через написанную выше функцию + присвоение результата в переменную a
            a = calculations_functions.calculate_a(x, y);
            // Вычисление a через написанную выше функцию + присвоение результата в переменную b
            b = calculations_functions.calculate_b(x, y, z);
            // Функцию можно вызывать обращаясь к классу если модуль и основная программа находятся в одной папке
            // То есть не нужно import импортировать модуль в начале программы

            // Вывод результатов в консоль
            System.out.printf("a = %.5f; b = %.5f", a, b);

        }
        // Если аргументы переданы верно и переданы все три, то присваеваем из в переменные x, y, z
        else if (args.length == 3) {
            try {       // try - проверяется часть кода на ошибки, если их нет то код идет по обычному алгоритму
                x = Double.parseDouble(args[0]);    // parseDouble - метод, который преобразует считываемые из консоли аргументы в тип double
                y = Double.parseDouble(args[1]);    // Это подобно nextDouble
                z = Double.parseDouble(args[2]);
            } catch (NumberFormatException e) {     // Если есть ошибка ( в данном случае типа переменой),то выводим сообщение
                System.out.println("Ошибка: Аргументы должны быть числами");
                System.exit(1);
            }
            // Вычисление a через написанную выше функцию + присвоение результата в переменную a
            a = calculations_functions.calculate_a(x, y);
            // Вычисление a через написанную выше функцию + присвоение результата в переменную b
            if ((b = calculations_functions.calculate_b(x, y, z)) == 0){
                return;
            }

            // Функцию можно вызывать обращаясь к классу если модуль и основная программа находятся в одной папке
            // То есть не нужно import импортировать модуль в начале программы

            // Вывод результатов в консоль
            System.out.printf("a = %.5f; b = %.5f", a, b);

        }
        // Иначе если никакие условия выше не подошли выводим пользователю сообщение
        else {
            System.out.println("Неправильно, должно быть передано 3 аргумента");
        }
    }
}
